import re


def solve(text, re_text, group):
    mat = re.search(re_text, text)
    if mat:
        return mat.group(group)
    else:
        return None


if __name__ == "__main__":
    # 以()()分組
    # \d >> 一個數字
    # \d* >> 多個數字
    # \w* >> 多個包括下劃線的任何單詞字符

    print(solve('1月22日1時47分', '(\w*) (\d*月\d*日\d*時\d*分)', 1))
    print(solve('陳小明2 11月22日11時47分', '(\w*) (\d*月\d*日\d*時\d*分)', 1))

    print(solve('0:0 陳小明3帳號...', '(\d*:\d*) (\w*)帳號...', 2))
    print(solve('10:42 陳小明4帳號...', '(\d*:\d*) (\w*)帳號...', 2))

    print(solve('10月22日10時47分 王小明5', '(\d*月\d*日\d*時\d*分) (\w*)', 2))
    print(solve('0月0日0時0分 王小明6', '(\d*月\d*日\d*時\d*分) (\w*)', 2))

    print(solve('【中国农业银行】朱家玉于09月14日12:11向您尾号7817账户完成转存交易人民币2001.70，余额15105.77。', '【中国农业银行】(\w*)于', 1))
"""
ex:
1. '陳小明1 1月22日1時47分', '(\w*) (\d*月\d*日\d*時\d*分)', 1  >>> '陳小明1'
2. '陳小明2 11月22日11時47分', '(\w*) (\d*月\d*日\d*時\d*分)', 1  >>> 陳小明2
3. '0:0 陳小明3帳號...', '(\d*:\d*) (\w*)帳號...', 2  >>> 陳小明3
4. '10:42 陳小明4帳號...', '(\d*:\d*) (\w*)帳號...', 2  >>> 陳小明4
5. '10月22日10時47分 王小明5', '(\d*月\d*日\d*時\d*分) (\w*)', 2  >>> 陳小明5
6. '0月0日0時0分 王小明6', '(\d*月\d*日\d*時\d*分) (\w*)', 2  >>> 陳小明6
"""
